app/controllers/books_controller.rb

	def index
   	   @books = Book.all
---
SELECT "books".* FROM "books" WHERE (lower(title) LIKE '%harry%' or lower(text) LIKE '%harry%' )

  	def create

  		@book = Book.new(book_params)
  		@book.attachment = params[:book][:attachment]
  		@book.user_id = current_user.id
   		if @book.save
---
INSERT INTO "books" ("title", "text", "created_at", "updated_at", "user_id", "attachment") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "helpy"], ["text", "nndsfkankl;csdl;amclk'wm"], ["created_at", "2018-05-07 11:33:16.490860"], ["updated_at", "2018-05-07 11:33:16.490860"], ["user_id", 1], ["attachment", "Q19.png"]]

  	def update
	    if @book.update(book_params)
---
UPDATE "books" SET "attachment" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["attachment", "Ruby_on_Rails_1_.pdf"], ["updated_at", "2018-05-09 06:07:35.487805"], ["id", 32]]

	def find_user
		@book= Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]